//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "Unit4.h"
#include "Unit1.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TForm4 *Form4;
//---------------------------------------------------------------------------
__fastcall TForm4::TForm4(TComponent* Owner)
        : TForm(Owner)
{
}
//---------------------------------------------------------------------------

void __fastcall TForm4::FormCreate(TObject *Sender)
{
const AnsiString Names[3]={"Время вылета","Время прилёта","Тип самолёта"};
int i;
for(i=0;i<3;i++) // цикл для подписи заголовков столбцов таблицы
 StringGrid1->Cells[i][0]=Names[i];
}
//---------------------------------------------------------------------------

